{
  "backend/main.mo": "Empty Motoko actor with no implemented methods.",
  "feature_evidence.json": "JSON scaffold for a feature evidence report with an empty features list.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend source files for reference.",
  "frontend/index.css": "Tailwind base and theme variables defining color tokens, dark mode values, and global styling.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component assembling all page sections using listing data.",
  "frontend/src/components/sections/FooterSection.tsx": "Footer showing agent contact info, property disclaimer, and attribution link.",
  "frontend/src/components/sections/GallerySection.tsx": "Gallery grid with a keyboard-accessible lightbox for full-size image viewing.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero banner showing property address, tagline, status badge, and background image.",
  "frontend/src/components/sections/HighlightsSection.tsx": "Section listing property highlights with checkmark icons.",
  "frontend/src/components/sections/KeyDetailsSection.tsx": "Displays key property stats and an inquiry phone link using card-like detail blocks.",
  "frontend/src/data/listing.ts": "Defines ListingData interface and exports static listing details for the sold property.",
  "frontend/src/hooks/useActor.ts": "React hook creating and updating a backend actor based on Internet Identity, with query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient, handling login, stored identity loading, and status flags.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file exporting nothing since no backend queries exist.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom OKLCH color variables for light and dark themes with accessibility-focused focus styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/tailwind.config.js": "Configures Tailwind with extended color tokens, typography, container queries, animations, and custom fonts and radius settings.",
  "project_state.json": "Stores project metadata including version, summary, project name, and empty feature request structures."
}